Ran Plan for dir: `terraform-gcp` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_instance.instance1 will be created
+ resource "google_compute_instance" "instance1" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = [
          + {
              + count = 4
              + type  = "nvidia-tesla-t4"
            },
        ]
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-32"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "instance1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = (known after apply)
          + preemptible         = true
        }
    }

  # google_dns_record_set.frontend will be created
+ resource "google_dns_record_set" "frontend" {
      + id           = (known after apply)
      + managed_zone = "zone"
      + name         = "frontend.123"
      + project      = (known after apply)
      + rrdatas      = [
          + "123.123.123.123]",
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 2 to add, 0 to change, 0 to destroy.


time="2022-02-03T09:13:01Z" level=info msg="Detected Terraform plan JSON file at /home/atlantis/.atlantis/repos/infracost/atlantis-demo/18/default/terraform-gcp/default.json"
time="2022-02-03T09:13:01Z" level=info msg="Starting: Extracting only cost-related params from terraform"
time="2022-02-03T09:13:01Z" level=info msg="Starting: Retrieving cloud prices to calculate costs"

Output saved to /tmp/infracost-atlantis-demo-18-default-terraform-gcp-infracost.json

##### Infracost estimate #####

Monthly cost will decrease by 555

Previous monthly cost: 0.00
New monthly cost: 555

Infracost output:

    Project: github.com/infracost/atlantis-demo.git/terraform-gcp/default.json
    
    + google_compute_instance.instance1
      +$555
    
        + Instance usage (Linux/UNIX, preemptible, n1-standard-32)
          +$234
    
        + Standard provisioned storage (pd-standard)
          +$0.40
    
        + NVIDIA Tesla T4 (preemptible)
          +$321
    
    + google_dns_record_set.frontend
      Monthly cost depends on usage
    
        + Queries
          Monthly cost depends on usage
            +$0.40 per 1M queries
    
    Monthly cost change for github.com/infracost/atlantis-demo.git/terraform-gcp/default.json
    Amount:  +$555 ($0.00 → $555)
    
    ──────────────────────────────────
    Key: ~ changed, + added, - removed
    
    2 cloud resources were detected:
    ∙ 2 were estimated, 1 includes usage-based costs, see https://infracost.io/usage-file

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-gcp`
* :put_litter_in_its_place: To **delete** this plan click [here](http://2b63d3f7ce22:4141/lock?id=infracost%252Fatlantis-demo%252Fterraform-gcp%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-gcp`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
